app/views/events/_events.erb

        <% end %>
        <td><% event.sections.each do |section|%><%= section.name %>&nbsp;<% end %></td>
---
SELECT "sections".* FROM "sections" INNER JOIN "section_events" ON "sections"."id" = "section_events"."section_id" WHERE "section_events"."event_id" = 21