app/views/events/_quick_add_form.erb

    <%= f.label :sections %><br />
    <%= f.grouped_collection_select :sections, Program.all, :sections, :name, :id, :name, {:include_blank => false}, { :multiple => true } %>
---
SELECT "programs".* FROM "programs"
SELECT "sections".* FROM "sections" WHERE "sections"."program_id" = 1