app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" LIMIT 10 OFFSET 0
---
  def index
    @departments = Department.paginate(:page => params[:page]).per_page(10)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @department = Department.find(params[:id])