app/controllers/events_controller.rb

  def index
    @events = Event.by_date_desc.all
---
SELECT "events".* FROM "events" WHERE "events"."date" = '2012-10-16'

  def edit
    @event = Event.find(params[:id])
    @sections = Section.joins('INNER JOIN section_events se ON se.section_id = sections.id INNER JOIN events e ON e.id = se.event_id').where('e.id = ?', @event.id).select('sections.id as section_id');
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
SELECT sections.id as section_id FROM "sections" INNER JOIN section_events se ON se.section_id = sections.id INNER JOIN events e ON e.id = se.event_id WHERE (e.id = 1)

  def create

    params[:event][:sections].shift
    sections = params[:event][:sections]
    event_id = params[:event][:id]
    params[:event].delete "sections"


    @event = Event.new(params[:event])

    respond_to do |format|
       if @event.save
          sections.each do |section_id|
            @section = SectionEvent.new({:event_id => @event.id, :section_id => section_id})
            @section.save
---
INSERT INTO "events" ("bibles_distributed", "created_at", "date", "end_time", "gospel_shared", "location_id", "meals_served", "program_id", "start_time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "section_events" ("created_at", "event_id", "section_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 29 Nov 2012 17:54:44 EST -05:00], ["event_id", 21], ["section_id", 9], ["updated_at", Thu, 29 Nov 2012 17:54:44 EST -05:00]]