app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index

    @groups = Group.paginate(:page => params[:page], :per_page => 15)