app/controllers/home_controller.rb

  def index
   @events = Event.current
   @all_events = Event.paginate(:page => params[:page], :per_page => 5)
   @past = Event.past.paginate(:page => params[:page], :per_page => 5)
   @all_notes = Note.all
---
SELECT "events".* FROM "events" WHERE (date = '2012-11-28')
SELECT COUNT(*) FROM "events"
SELECT "notes".* FROM "notes"

  def checkin
    session[:event] = params[:event_id]
    @event = Event.find(session[:event])
    if @event.program.scan_by_absence && session[session[:event].intern].nil?
      @absent_students = Event.absentees(session[:event])
      if(!@absent_students.nil?)
        @absent_students.each do |student|
          student.attendances.create(event_id: session[:event])
        end
      end
      @attendees = Event.attendees(session[:event])
      @absentees = Event.absentees(session[:event])
      session[session[:event].intern] = 1;
    else
      @attendees = Event.attendees(session[:event])
      @absentees = Event.absentees(session[:event])
    end

    if !@event.program.scan_by_absence && params[:barcode] && session[:event]
      @student = Student.find_by_barcode_number(params[:barcode])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "21"]]
INSERT INTO "attendances" ("created_at", "event_id", "exempt", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 29 Nov 2012 18:26:57 EST -05:00], ["event_id", 21], ["exempt", nil], ["student_id", 4], ["updated_at", Thu, 29 Nov 2012 18:26:57 EST -05:00]]
SELECT "students".* FROM "students" WHERE "students"."barcode_number" = '408155934888' LIMIT 1

    if @event.program.scan_by_absence && params[:barcode] && session[:event]
      @student = Student.find_by_barcode_number(params[:barcode])
      if @student
        @attendance = Attendance.find_by_student_id_and_event_id(@student.id,session[:event])
        if(!@attendance.nil?)
          if @student.attendances.destroy(@attendance.id)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."student_id" = 4 AND "attendances"."event_id" = 21 LIMIT 1
DELETE FROM "attendances" WHERE "attendances"."id" = ?  [["id", 1]]