app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" ORDER BY name LIMIT 10 OFFSET 0
---
  def index
    @locations = Location.alphabetical.paginate(:page => params[:page]).per_page(10)