app/controllers/notes_controller.rb

  def edit
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @note = Note.new(params[:note])
    @note.user_id = current_user.id
    @user_name = current_user.name
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("contents", "created_at", "date", "notable_id", "notable_type", "priority", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "notes" SET "priority" = '1', "updated_at" = '2012-11-30 22:33:32.124890' WHERE "notes"."id" = 1

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]