app/controllers/programs_controller.rb

  def index
    @programs = Program.paginate(:page => params[:page], :per_page => 15)
---
SELECT "programs".* FROM "programs" ORDER BY name LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "programs"

  def show
    @program = Program.find(params[:id])
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "14"]]

  def edit
    @program = Program.find(params[:id])
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "10"]]

  def create
    @program = Program.new(params[:program])

    respond_to do |format|
      if @program.save
---
INSERT INTO "programs" ("active", "created_at", "department_id", "description", "end_date", "max_capacity", "max_grade", "min_grade", "name", "scan_by_absence", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @program = Program.find(params[:id])

    respond_to do |format|
      if @program.update_attributes(params[:program])
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "programs" SET "scan_by_absence" = 't', "updated_at" = '2012-11-30 04:40:16.276214' WHERE "programs"."id" = 3