app/controllers/sections_controller.rb

  def index
    @sections = Section.paginate(:page => params[:page]).per_page(10)
---
SELECT "sections".* FROM "sections" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "sections"

  def show
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "24"]]

  def create
    @section = Section.new(params[:section])

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("active", "created_at", "max_capacity", "name", "program_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["active", true], ["created_at", Thu, 29 Nov 2012 18:06:48 EST -05:00], ["max_capacity", 12], ["name", "test"], ["program_id", 6], ["updated_at", Thu, 29 Nov 2012 18:06:48 EST -05:00]]