app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE (first_name LIKE '%rage%' or last_name LIKE '%rage%')
SELECT COUNT(*) FROM "students"
---
  def index
    # @students = Student.search(params[:query])
    # we need to figure out a way to do both
    # @query = Student.search(params[:query])
    @students = Student.paginate(:page => params[:page], :per_page => 15)