app/controllers/tokens_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'profh@cmu.edu' LIMIT 1
---
    def create
      email = params[:email]
      password = params[:password]

      if email.nil? or password.nil?
         respond_to do |format|

          format.json { render :json=>{:message=>"Please enter your user name and password."}, :callback => params[:callback] }
         end
      end

    @user=User.find_by_email(email.downcase)

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = 'V9DjfSJKVxLdax8B87YL' LIMIT 1
---
  def destroy
    @user=User.find_by_authentication_token(params[:id])